{
    "Scrubs": {
        "status": "Ended", 
        "rating": "9.0", 
        "last_episode": "", 
        "description": "Scrubs focuses on the lives of several people working at Sacred Heart, a teaching hospital. It features fast-paced dialogue, slapstick, and surreal vignettes presented mostly as the daydreams of the central character, Dr. John Michael \"J.D.\" Dorian.", 
        "language": "", 
        "sj_link": "", 
        "userstatus": "", 
        "seasons": {
            "0": {
                "1": {
                    "rating": "6.7", 
                    "description": "Sunny, a new intern at Sacred Heart Hospital explains that she thought it would be fun to document her first year at the hospital with a video diary. She double majored in Pre-Med and Film at college, so she promises they won't be boring. Using freeze frames, she introduces herself and explains her nickname, Katie as possibly two-faced, Howie as snarky, Ed as always late, and Denise as her new Besty, but Denise comes off as kind of a bully.\n\nIn orientation, Ted tells the interns that lawsuits are bad and that they should never tell a patient if they make a mistake. Dr. Cox enters the orientation and tells the interns that it will not be a fun year for anybody, and when Sunny tells her camera she is still going to enjoy it, he confiscates her camera.\n\nLater, Sunny tells the camera that a Janitor sold her her camera back, and pays The Worthless Peons to perform a theme song for her video diary.", 
                    "episodename": "Webisode 1 - Our Intern Class", 
                    "air_date": "2009-01-01"
                }, 
                "2": {
                    "rating": "7.0", 
                    "description": "Sunny set up cameras around the classroom so her diary would be exciting. She is listening to Katie's and Denise's conversation about their sex lives. Katie finds it hard to be sexually active because of how busy she is at Sacred Heart. She then rejects Howie's offer. Denise states that she like guys with some meat on them because they \"try harder\".\n\nDr. John Dorian enters the room, apologizes for having to leave, and continues giving a lesson about hospital vernacular. He explains many acronyms such as CTD (circling the drain), T.C.W. (tasty coma wife), \"gomer\" (get outta my emergency room), turfing and bouncing (send patients to other wards), LGFD (looks good from door) and HFFA (hot from far away). He then ends the lecture and leaves. Sunny finds a strange note which tells her \"Meeting in broom closet after lecture. Be there.\" which none of the other interns received.", 
                    "episodename": "Webisode 2 - Our Meeting with J.D.", 
                    "air_date": "2009-01-07"
                }, 
                "3": {
                    "rating": "6.7", 
                    "description": "After Sunny received her mysterious note when she was in lecture with J.D., her and Howie, Denise and Katie visit the broom closet. There, a shelf slides away revealing a man sitting at a desk. The man is Janitor. He lays down some ground rules for their behavior at Sacred Heart. He tells them that they are not allowed to wrong him or enter Brain Trust headquarters. Janitor asks if anyone likes Dr. John Dorian, to which Katie says yes, and he kicks her out of his office.\n\nTed enters and notifies Janitor that his next appointment - a man with a raccoon - has arrived. Janitor then kicks the interns out of his office.", 
                    "episodename": "Webisode 3 - Our Meeting in the Broom Closet", 
                    "air_date": "2009-01-13"
                }, 
                "season_link_sj": "", 
                "5": {
                    "rating": "5.3", 
                    "description": "While Sunny tells us about her upcoming class with Dr. Turk, suddenly Jimmy comes into the room. And once again, he is touching everybody, everywhere. Denise actually enjoys the touching, Howie not so much. And Katie even kisses Jimmy.\n\nAfter that, Sunny suddenly can't find her video camera anymore.\n\nAs it turns out, Jimmy has taken it from her, to film a fake talk show called The Jimmy the Orderly Show. In it, he impersonates the talk show host and several well known actors from TV and cinema.\n\nThen, Sunny comes into the room, where Jimmy is, and sees, that he took her camery. But he says, that he only borrowed it for the Jimmy the Orderly Show. And since every Jimmy the Orderly Show ends in a dance off, Sunny and Jimmy began to dance.", 
                    "episodename": "Webisode 5 - The Late Night with Jimmy Show", 
                    "air_date": "2009-02-03"
                }, 
                "6": {
                    "rating": "6.5", 
                    "description": "As Sunny busily works in the ward at Sacred Heart, she tells the audience that she captured some secret footage of a Brain Trust meeting.\n\nAt the meeting, Janitor calls the meeting to order with a hammer as a gavel. He explains that Doug is not present because he may have looked at Janitor wrong. Janitor denies Todd's motion to date Sunny, and also denies his motion to go shirtless for the rest of the meeting. Ted is upset because it is very hot in the meeting. Janitor states that Sunny's cameras are not only important because they will capture the Brain Trust so children can later learn from it, but also so she can make Legal Custodians, a sitcom featuring Janitor and Ted as parents. Todd wants to be in the series, but Janitor tells him that they will just CGI in a child later.\n\nThey record the theme sequence, but when it comes time to shoot the pilot, Janitor tells Sunny to write the script. Sunny tells the viewers that next week will feature the pilot episode of Legal Custodians.", 
                    "episodename": "Webisode 6 - Our Meeting with the Brain Trust", 
                    "air_date": "2009-02-10"
                }, 
                "7": {
                    "rating": null, 
                    "description": "Sunny can't help but sing the theme song to Legal Custodians as she introduces some outtakes for the new series.\n\nIn the outtakes, Janitor argues with Ted who can't seem to remember any of his lines. Ted also complains about his sweater being very itchy, and tries to take it off, but the Janitor won't let him. The Janitor also quizzes Ted as to what \"jump the shark\" means, and he can't answer. Ted also explains that he has never had to memorize a closing statement for a court case before. In the end, Ted can't stand his sweater anymore and ends up pulling it over his face, running into a wall, and falling to the ground.\n\nAt the same time, Todd hides behind the couch and the counter holding the \"child\" in the sitcom.", 
                    "episodename": "Webisode 7 - Outakes from Legal Custodians", 
                    "air_date": "2009-03-18"
                }, 
                "8": {
                    "rating": null, 
                    "description": "Sunny records a teaching session by the sexy yet insane Dr. Reed regarding bedside manners.", 
                    "episodename": "Webisode 8 - Our Bedside Manner", 
                    "air_date": "2009-03-25"
                }, 
                "9": {
                    "rating": null, 
                    "description": "The medical interns have a meetings with two of the surgeons: Turk and The Todd.", 
                    "episodename": "Webisode 9 - Our Meeting With Turk and the Todd", 
                    "air_date": "2009-04-01"
                }, 
                "10": {
                    "rating": "7.0", 
                    "description": "After promising to buy him a cup of coffee, Sunny sits down with Dr. Kelso in Coffee Bucks so he can give her some final advice as an intern. He yells at her when she doesn't want to buy him a coffee because he is already drinking one, and he eventually begins telling her advice anyway. He tells her that she must always be on time, always have a weak friend to blame her problems on, and always keep secrets about rendezvous in the on-call room.\n\nAs Sunny states that she has to give the camcorder to her sister so she can record her ugly baby, she shows clips of Ed, Denise, Katie, and Howie remembering the advice they learned around the hospital.", 
                    "episodename": "Webisode 10 - Our Final Advice", 
                    "air_date": "2009-04-08"
                }, 
                "11": {
                    "rating": null, 
                    "description": "Carla explains to the interns that nurses are to be respected.", 
                    "episodename": "Webisode 11 - Our Meeting With Carla", 
                    "air_date": null
                }, 
                "12": {
                    "rating": null, 
                    "description": "Janitor and Ted screen the pilot of their sitcom Legal Custodians.", 
                    "episodename": "Webisode 12 - Legal Custodians Episode", 
                    "air_date": null
                }, 
                "13": {
                    "rating": null, 
                    "description": "A collection of clips and bloopers from the first two seasons of the hit NBC comedy.", 
                    "episodename": "Scrubs Funniest Moments", 
                    "air_date": "2003-04-24"
                }, 
                "4": {
                    "rating": "7.5", 
                    "description": "Sunny has her day off, so instead of presenting a regular episode of her video diary, she shows Ted and a girl playing ukulele presenting a song, and calls the episode: \"That Bald Sweaty Lawyer & The Girl that he's Sweet on\".", 
                    "episodename": "Webisode 4 - Screw You with Ted and the Gooch", 
                    "air_date": "2009-01-27"
                }
            }, 
            "1": {
                "1": {
                    "rating": "7.6", 
                    "description": "John Dorian, \"J.D.\" to friends, is a boyishly handsome, self-deprecatingly funny, likeable guy who would be confident if he only realized his assets. Four years of medical school have prepared J.D. for his first day as an intern at Sacred Heart Hospital - but he has his doubts. As J.D. is thrown into the chaotic world of hospital life, we not only get to see the quirky characters that he encounters, but also hear the humorous commentary of thoughts streaming through J.D.'s head. By J.D.'s side is his best friend since college, the handsome and confident Chris Turk. As a new surgical intern, Turk struts around with a gregarious and cocky demeanor that hides a terror that he only admits to J.D. Both guys initially have the hots for their attractive fellow intern, Elliot Reid, but J.D. quickly finds out her beauty is only surpassed by her hyper-competitive attitude. Guiding the interns' education are those with more medical experience. Dr. Robert \"Bob\" Kelso, Chief of Medicine, wants the interns to think they can count on him. On the other side of the personality spectrum is Dr. Percival \"Perry\" Cox, a steamroller of a man short on patience. Watching over the interns with a caustically teasing but caring demeanor, is nurse Carla Espinosa, a woman who is motherly and sexy at the same time - which appeals mightily to Turk.", 
                    "episodename": "My First Day", 
                    "air_date": "2001-10-02"
                }, 
                "2": {
                    "rating": "7.2", 
                    "description": "J.D. tries to persuade a smoker patient to quit smoking in order to impress Dr. Cox, who is just feeling lonely in his opinion. Elliot's attitude towards Carla annoys her, thus Turk is able to go on a date with Carla, when he convinces her to forgive Elliot.", 
                    "episodename": "My Mentor", 
                    "air_date": "2001-10-04"
                }, 
                "3": {
                    "rating": "7.4", 
                    "description": "J.D. begins to feel distant from Turk, when he leaves him abandoned every time that he tries to talk to him. Elliot fights with Kelso for calling her \"sweetheart,\" and she seeks Dr. Cox's advice. J.D.'s relationship with Elliot goes in a time race, when he has 48 hours to kiss her before he is put into her \"Friend Zone.\"", 
                    "episodename": "My Best Friend's Mistake", 
                    "air_date": "2001-10-09"
                }, 
                "4": {
                    "rating": "7.7", 
                    "description": "The three interns are each assigned patients with various illnesses. Statistically speaking, one of the three is going to die. J.D.'s patient is 86 year old Mrs. Tanner, who is in renal failure. 20 year old David Morrison is Turk's hernia patient and Elliot's patient Mrs. Guerrero only speaks Spanish and might have lupus.", 
                    "episodename": "My Old Lady", 
                    "air_date": "2001-10-16"
                }, 
                "5": {
                    "rating": "7.5", 
                    "description": "J.D. points out what seems to be a technical mistake to Dr. Kelso, but it was really an attempt of Dr. Cox to save a woman without insurance using a dead guy's insurance. Dr. Kelso and Dr. Cox show J.D. their different ways of looking at medicine. Meanwhile, the Janitor intimidates J.D., Elliot discovers the healing powers of her boobs and Turk gives Carla a pen he thought he took from the Lost and Found box.", 
                    "episodename": "My Two Dads", 
                    "air_date": "2001-10-23"
                }, 
                "6": {
                    "rating": "7.4", 
                    "description": "Dr. Cox is still facing the threat of suspension, and coincidentally, J.D. is assigned to a special patient: Jordan Sullivan, an important board member. She is very demanding and J.D. ends up sleeping with her after he confronts her. Only he didn't know that she is Dr. Cox's ex-wife, and now the only one who can save J.D.'s mentor from being fired by the evil Dr. Kelso.\nMeanwhile, Elliot is assigned to take care of a shrink whose jaw has been wired shut, and for whom she ends up becoming a patient. Carla's mom makes a scandal after Turk spends the night at Carla's, and when she breaks her leg, Carla blames Turk for it.", 
                    "episodename": "My Bad", 
                    "air_date": "2001-10-30"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "J.D. has finally earned the spot as brightest student, but he's got competition: Nick Murdoch, who seems to be nicer, friendlier and has a better butt than him. But even J.D. can't hate the guy, for he is so nice. But he is surprised when he finds Nick sitting in a corner crying because he can't take the pressure of medical internship.\nMeanwhile, Turk is having problems at the operation table and doesn't tell Carla, who keeps bothering Dr. Cox about it.\nAnd Dr. Cox gives Turk a very unique suggestion on how to calm down before surgery.", 
                    "episodename": "My Super Ego", 
                    "air_date": "2001-11-06"
                }, 
                "8": {
                    "rating": "7.5", 
                    "description": "J.D. and Turk become heroes after saving a cameraman's life on TV, while heading to a strip club. But Turk quickly becomes the target of a new publicity campaign led by Dr. Kelso, exploiting the hospital's diversity.\nMeanwhile, J.D. worries about his evaluation. Elliot is going out with Carla, but in the last minute she blows her off and later Elliot runs into her in a bar.", 
                    "episodename": "My Fifteen Minutes", 
                    "air_date": "2001-11-15"
                }, 
                "9": {
                    "rating": "7.2", 
                    "description": "J.D. gets to see the hospital through the eyes of a patient when he's admitted for appendicitis. Elliot examines him and he tells everyone how cold and rough she is, which drives her crazy. J.D. doesn't want Turk to operate on him, which hurts Turk's feelings.\nMeanwhile, Dr. Cox is trying to show off to his mentor, Dr. Benson, the ex-chief of medicine, who is also a patient at the hospital. The only thing in his way is Dr. Kelso, who almost dismissed Dr. Benson prematurely.", 
                    "episodename": "My Day Off", 
                    "air_date": "2001-11-20"
                }, 
                "10": {
                    "rating": "7.4", 
                    "description": "J.D. begins a new relationship with Carla. J.D. gains a new nickname - \"Scooter\" - and his relationship with Nurse Carla evolves as he begins to out-distance her medical knowledge, while Turk trembles, when he learns that his secret lunch spot was claimed years ago by the territorial Dr. Kelso.\nElsewhere, Dr. Cox gives Elliot the evil eye when she won't discharge a troublesome patient.", 
                    "episodename": "My Nickname", 
                    "air_date": "2001-11-27"
                }, 
                "11": {
                    "rating": "7.4", 
                    "description": "It's Christmas, and even though J.D. and the others don't really feel like celebrating, Turk makes a huge deal about it. But his faith and happiness are gone after a very busy night at the hospital.\nDr. Cox has J.D. videotape the birth of the child of one of his friends.", 
                    "episodename": "My Own Personal Jesus", 
                    "air_date": "2001-12-11"
                }, 
                "12": {
                    "rating": "7.6", 
                    "description": "A woman slips and falls on the wet floor of the hospital. Afraid that she might sue the hospital, Dr. Kelso asks J.D. to stand by her and be friendly, so she won't sue them. But J.D. is very busy with Dr. Cox's 24-hour marathon to keep his ICU patients alive.\nElliot is desperate for some attention from Dr. Cox. Meanwhile, Turk snaps at Carla when she steals fries from his plate.", 
                    "episodename": "My Blind Date", 
                    "air_date": "2002-01-08"
                }, 
                "13": {
                    "rating": "7.5", 
                    "description": "J.D. is frustrated when his budding romance with an ex-patient wilts as their dates are constantly interrupted by emergency calls, while the beastly Dr. Kelso becomes less fearsome to the wide-eyed interns, when Dr. Cox informs them how to avoid the blowhard's bite. In addition, a perplexed Carla and Turk deal with their first sexual intimacy complication.", 
                    "episodename": "My Balancing Act", 
                    "air_date": "2002-01-15"
                }, 
                "14": {
                    "rating": "7.3", 
                    "description": "Alex and Elliot argue over missing medication, and J.D. needs to choose sides.\nMeanwhile, Dr. Kelso gives Carla a ride to work and she sees a totally different side of him. Turk develops a conflict with Dr. Cox after he finds out that Dr. Cox has secret feelings for Carla.", 
                    "episodename": "My Drug Buddy", 
                    "air_date": "2002-01-22"
                }, 
                "15": {
                    "rating": "7.6", 
                    "description": "After going to bed and spending an entire day having sex, J.D. and Elliot go to work trying to hide their new secret romance, but everybody already knows it.", 
                    "episodename": "My Bed Banter & Beyond", 
                    "air_date": "2002-02-05"
                }, 
                "16": {
                    "rating": "7.4", 
                    "description": "When a rampaging Dr. Cox suddenly shows up at his door in a strange funk, J.D. sees a possibility of a breakthrough in their relationship - until he learns that Cox loses control in almost an annual rite. Meanwhile, Turk elects to partner with Elliot on a research project so that he can maneuver her back with his buddy J.D., and Carla struggles to fulfill a comatose patient's final request - playing heavy metal music in his room.", 
                    "episodename": "My Heavy Meddle", 
                    "air_date": "2002-02-26"
                }, 
                "17": {
                    "rating": "7.4", 
                    "description": "J.D., Elliot and Turk are receiving their first medical students, and now they finally get a chance to see what it feels like to be on the other side. Turk's student is a very attractive young woman, to whom Dr. Cox is immediately attracted. But he doesn't know his way around women and needs Turk to give him a little help. J.D. doesn't know how to handle his student and Elliot's turns out to the be son of an important CEO.", 
                    "episodename": "My Student", 
                    "air_date": "2002-03-05"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "J.D. has a patient who's rude to him and the nurses and eventually dies from cancer. J.D. feels awful for not giving him his full attention and worries maybe he could have saved the guy if he was nicer to him.\nMeanwhile, Elliot is convinced that Dr. Kelso is the one singing a song called \"Tuscaloosa Heart\" on a tape given to her by a patient who claims he went to college with Bob. And Dr. Cox finds himself trapped in a love square: He's falling in love with Kristen Murphy, his intern, just as his ex-wife reappears demanding sex – and there's also his crush on Carla.", 
                    "episodename": "My Tuscaloosa Heart", 
                    "air_date": "2002-03-12"
                }, 
                "19": {
                    "rating": "7.7", 
                    "description": "An assortment of moms and dads descend on their offspring at home and in the workplace. J.D.'s father is a gregarious yet lonely divorcee who's desperately trying to be just one of the guys. Elliot's folks, on the other hand, are a snooty couple whose pompous behavior dismays their daughter. Similarly rattled is Turk, unnerved by the bonding of his girlfriend, Carla, and his brassy mother. But the most vexatious parent by far is the janitor's dad.", 
                    "episodename": "My Old Man", 
                    "air_date": "2002-04-09"
                }, 
                "20": {
                    "rating": "7.7", 
                    "description": "Turk's competitiveness is starting to annoy J.D., especially when it crosses the line of personal jokes and comes to patient's matters.\nMeanwhile, Dr. Cox finally has a taste of good coffee, but thanks to his feud with Dr. Kelso, the only nurse who was able to make it gets fired. Elliot meets a very attractive patient, whom she instantly identifies, but has a really hard time getting him to ask her out.", 
                    "episodename": "My Way or the Highway", 
                    "air_date": "2002-04-16"
                }, 
                "21": {
                    "rating": "7.4", 
                    "description": "J.D. fears being contaminated with Hepatitis B, after a needle accidentally sticks his forearm.\nMeanwhile, Elliot has a hard time combining her new relationship and keeping up with studies. Turk obsesses about getting in shape, after Carla makes a fat joke about him.", 
                    "episodename": "My Sacrificial Clam", 
                    "air_date": "2002-04-30"
                }, 
                "22": {
                    "rating": "7.9", 
                    "description": "Jordan's brother Ben is admitted at Sacred Heart for having an accident with a nail gun. J.D. learns that Ben has leukemia, but won't believe it, since there have been many mixups in the hospital lately, so he goes on a search for the real test results.", 
                    "episodename": "My Occurrence", 
                    "air_date": "2002-05-07"
                }, 
                "23": {
                    "rating": "7.7", 
                    "description": "Ben takes the news of his diagnosis pretty well - at least better than his sister Jordan and J.D. Remarkably, it is Dr. Cox who is the voice of reason and compassion, until his own fears get in the way.\nMeanwhile, Turk and Elliot have their own issues to deal with. Turk is upset because he wasn't chosen to assist on a difficult surgery and Elliot is criticized during rounds by Dr. Kelso for the 100th time.", 
                    "episodename": "My Hero", 
                    "air_date": "2002-05-14"
                }, 
                "24": {
                    "rating": "8.0", 
                    "description": "It's J.D.'s last day as an intern, and soon he will become a resident. Carla and Turk are arguing about dating other people. Elliot finally rebels against being everyone's doormat, and J.D. is just trying to stay out of people's way.\nJordan has returned to get a physical and a new patient, Mr. Bober, has been admitted, because he needs his gall bladder removed. He really needs the surgery, but doesn't have the insurance to pay for it. They enlist the help of Dr. Cox, Dr. Wen and Jordan.", 
                    "episodename": "My Last Day", 
                    "air_date": "2002-05-21"
                }, 
                "season_link_sj": ""
            }, 
            "2": {
                "1": {
                    "rating": "7.8", 
                    "description": "Relationships between the staff of Sacred Heart Hospital have been shaken since Jordan's revelations. Turk is sleeping on J.D.'s bed, after Carla kicked him out of his own. Elliot is having a hard time facing J.D. every day at work. J.D. desperately tries to get Dr. Cox's attention back, unsuccessfully.", 
                    "episodename": "My Overkill", 
                    "air_date": "2002-09-26"
                }, 
                "2": {
                    "rating": "7.7", 
                    "description": "J.D., Elliot and Turk find themselves alone in the hospital night shift and face responsibilities without supervision for the first time. Luckily, they have Carla there to support and guide them through the night.\nMeanwhile, Dr. Cox doesn't know what to do, when he realizes that he has feelings for his ex-wife Jordan and is asked (forced actually) to introduce Dr. Kelso at a social event, where he will be receiving an award from the medical board.", 
                    "episodename": "My Nightingale", 
                    "air_date": "2002-10-03"
                }, 
                "3": {
                    "rating": "7.4", 
                    "description": "When Dr. Kelso challenges the residents by offering a trip to a medical conference in Reno as a reward to the individual, who presents the most interesting case study, J.D. refuses to play along, earning him the respect of Dr. Cox.\nIn the meantime, Turk misses his opportunity to ask for a new laser on the one day of the year, that Dr. Kelso grants favors, so he is forced to find another way to come up with the goods.", 
                    "episodename": "My Case Study", 
                    "air_date": "2002-10-10"
                }, 
                "4": {
                    "rating": "7.5", 
                    "description": "J.D. insists that Carla should open up to him. When she finally starts to do that, J.D. screws it up by telling Turk. Elliot is desperate for attention from Dr. Cox. Turk sees himself in an ethical dilemma when Dr. Kelso picks him over a female surgeon to spend a weekend in Mexico.", 
                    "episodename": "My Big Mouth", 
                    "air_date": "2002-10-17"
                }, 
                "5": {
                    "rating": "7.5", 
                    "description": "Elliot sleeps with a handsome doctor she hardly knew and soon becomes the hospital tramp. Turk suffers from his back after operating with Dr. Amato, a very short surgeon. J.D. finds out that wearing a white coat doesn't make him a better doctor, but is upset by having Dr. Cox throw in his face that he made another mistake. And Dr. Kelso is just dying for an opportunity to lash out his anger on Dr. Cox.", 
                    "episodename": "My New Coat", 
                    "air_date": "2002-10-24"
                }, 
                "6": {
                    "rating": "7.4", 
                    "description": "J.D.'s brother is in town. Turk is thrown out of a patient's funeral for not knowing his name and feels even worse because earlier he made a bet with Dr. Cox over another patient's life.", 
                    "episodename": "My Big Brother", 
                    "air_date": "2002-10-31"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "All of the male doctors are euphoric due to the visit of Julie Keaton, the pharmaceutical sales rep, except for Dr. Cox, who still believes in treating patients for their best health, instead of trying to get some attention from the hot Ms. Keaton.\nMeanwhile, J.D. and Elliot argue over a risky decision regarding one of Elliot's patients. Turk tries to talk Carla into entering a practitioner nurse course, so she won't be so underestimated by the doctor's staff.", 
                    "episodename": "My First Step", 
                    "air_date": "2002-11-07"
                }, 
                "8": {
                    "rating": "7.4", 
                    "description": "When an expectant Jordan shows up unexpectedly, Cox is forced to choose between her and his new love, Julie.\nMeanwhile, J.D. and Turk take advantage of the hospital's supply closet for sleep, when they take on extra shifts at a free clinic to supplement their income. Carla encourages Elliot to stand up to her father, when he pressures her to pick a specialty more \"suitable for a woman.\"", 
                    "episodename": "My Fruit Cups", 
                    "air_date": "2002-11-14"
                }, 
                "9": {
                    "rating": "7.5", 
                    "description": "Ever since her father cut her off financially, Elliot's been feeling the weight of the world on her back. While having to find a new affordable place to live, she also has to face the threat of being sued by a patient whom she told he had only eight months to live. Carla and Jordan hit a sore spot when Carla gives her opinion on Jordan and Perry's relationship.\nMeanwhile, J.D. has a fight with Dr. Cox and the two dispute over who gets to give the better treatment to two patients with the same prognosis.", 
                    "episodename": "My Lucky Day", 
                    "air_date": "2002-12-05"
                }, 
                "10": {
                    "rating": "7.5", 
                    "description": "Elliot still doesn't have a place to live. J.D. think he's lost his mojo when he can't even kiss the giftshop girl while they go out on a date. Turk and Carla are having romance problems, because she feels he's not being as generous to her as she is to him. And Dr. Cox freaks out when he lets Jordan move in to his place due to her pregnancy.", 
                    "episodename": "My Monster", 
                    "air_date": "2002-12-12"
                }, 
                "11": {
                    "rating": "7.4", 
                    "description": "Renewed sex with J.D. calms Elliot, who's facing personal and professional dilemmas: She's broke, and patients are bailing out on her.", 
                    "episodename": "My Sex Buddy", 
                    "air_date": "2003-01-02"
                }, 
                "12": {
                    "rating": "7.6", 
                    "description": "Comeuppances are in store for Dr. Cox, Dr. Kelso and J.D. from a hypochondriac, a surgical patient and Elliot, who wants more than just sex from J.D.", 
                    "episodename": "My New Old Friend", 
                    "air_date": "2003-01-09"
                }, 
                "13": {
                    "rating": "7.8", 
                    "description": "J.D. bonds with a patient, who is waiting for a heart transplant and discusses with her their idea of what death must be like. Elliot puts her foot down and demands a feminine locker room from Dr. Kelso. Turk decides it's time to propose to Carla, but a kid swallows the engagement ring.", 
                    "episodename": "My Philosophy", 
                    "air_date": "2003-01-16"
                }, 
                "14": {
                    "rating": "7.5", 
                    "description": "Turk is still waiting for Carla to answer his proposal and asks his brother to stay over a few days to help him deal with it. Dr. Townshend, an old friend of Dr. Kelso and one of the nicest doctors around befriends J.D.\nElliot accidentally finds out the sex of Jordan's baby, becoming the object of Dr. Cox's anxiety.", 
                    "episodename": "My Brother, My Keeper", 
                    "air_date": "2003-01-23"
                }, 
                "15": {
                    "rating": "7.6", 
                    "description": "Elliot meets a nice guy at the bar, but freaks out when she finds out he's a male nurse at Sacred Heart. Turk keeps asking Carla to marry him, but she still won't give an answer. Dr. Cox feels the pressure he puts on himself everyday: His psychiatrist, his subordination to Dr. Kelso and his paternal feelings for J.D.", 
                    "episodename": "His Story", 
                    "air_date": "2003-01-30"
                }, 
                "16": {
                    "rating": "7.7", 
                    "description": "J.D. and Turk think they've got bad karma after hitting a car and causing an accident, while playing golf on the hospital roof. Dr. Cox bends over backwards to give Jordan as much comfort as possible on her labor day, and she confesses to J.D. that Dr. Cox is the real father. Elliot seeks advice from Carla on how to tell Paul that she's crazy, because they're getting more intimate and she can't hide it anymore. But Carla is feeling too crazy herself with the upcoming wedding.", 
                    "episodename": "My Karma", 
                    "air_date": "2003-02-20"
                }, 
                "17": {
                    "rating": "7.5", 
                    "description": "A personal secret of Dr. Cox is revealed during hospital visitations by a cocky MD (Jay Mohr), who establishes a rapport with J.D.", 
                    "episodename": "My Own Private Practice Guy", 
                    "air_date": "2003-03-13"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "J.D. flirts with the wife of a patient who's been in a coma for the past two years, whom they all call T.C.W. (Tasty Coma Wife). He feels guilty for doing that, even though she wants to go ahead with it. Meanwhile, he can't stand listening to any more relationship problems, as everybody dumps their issues on his ears: Elliot, sabotaging her relationship with Paul over beef jerky, Carla, finding out her engagement ring passed through a patient's digestive system and Dr. Cox's unsucessful attempts to get some attention from Jordan, who can only think about her baby right now.", 
                    "episodename": "My T.C.W.", 
                    "air_date": "2003-03-20"
                }, 
                "19": {
                    "rating": "7.5", 
                    "description": "Turk takes J.D. up to surgery, and right from the start J.D. steps all over Turk when trying not to be the geek among the surgeons. Paul hears Elliot say \"I love U2\" while she was rearranging her CDs and thinks she said \"I love you too.\" Dr. Cox decides to get even with Dr. Kelso by telling everyone he's dead, revealing what people really think of him.", 
                    "episodename": "My Kingdom", 
                    "air_date": "2003-03-27"
                }, 
                "20": {
                    "rating": "7.6", 
                    "description": "Jamie's (T.C.W.) husband died, and J.D. struggles with the ethical issues involved in starting a relationship with her. Dr. Cox babysits his son, whom Jordan still hasn't chosen a name for, and is disturbed that he feels nothing for the baby. Turk is haunted by erotic dreams about Elliot, which gets him into hot water with Carla.", 
                    "episodename": "My Interpretation", 
                    "air_date": "2003-04-03"
                }, 
                "21": {
                    "rating": "7.4", 
                    "description": "J.D. carries on with his romance with Jamie, but finds himself at a dead end after realizing she's a drama queen. Dr. Kelso makes Dr. Cox give a class on how to approach the patients nicely in order to prevent possible law suits. Carla's mother dies and she wants to get married.", 
                    "episodename": "My Drama Queen", 
                    "air_date": "2003-04-10"
                }, 
                "22": {
                    "rating": "7.6", 
                    "description": "J.D. and Turk's college buddy, Spence, drops by for a visit, and accidentally tells Dr. Cox a secret. Too much partying with successful Spence causes Turk and J.D. to show up late and drunk for work, which Dr. Kelso fully reprehends them for. Elliot's feeling low since she can't measure up to Dr. Kelso's standards, and the Janitor starts another feud – this time over paychecks – with J.D.", 
                    "episodename": "My Dream Job", 
                    "air_date": "2003-04-17"
                }, 
                "season_link_sj": ""
            }, 
            "3": {
                "1": {
                    "rating": "7.6", 
                    "description": "A run-in with her old flame Sean and an accident in her new car lead Elliot to the realization that nothing good has happened to her in the three years that she has been at Sacred Heart. This realization drives her to take drastic measures, including a complete makeover, both inside and out, in an attempt to change her luck.\nMeanwhile, J.D. gets stuck with a patient, whose diagnosis he can't quite pin down, and when Dr. Cox denies him any assistance, he looks to Carla and Turk to help him out. While Dr. Cox is busy not helping J.D., he takes the time to make amends with Dr. Kelso.", 
                    "episodename": "My Own American Girl", 
                    "air_date": "2003-10-02"
                }, 
                "2": {
                    "rating": "7.4", 
                    "description": "J.D. is feeling left out of his friendship with Turk and gets hurt when Turk is scared of opening up to him.\nMeanwhile, Carla is driven crazy over an unidentified urine sample, and Elliot tries to balance Sean and her career, so that one doesn't end up getting in the way of the other.", 
                    "episodename": "My Journey", 
                    "air_date": "2003-10-09"
                }, 
                "3": {
                    "rating": "7.4", 
                    "description": "Finding difficulties training his interns, J.D. asks to Elliot for some help. She tells J.D. about Sean, who gave Elliot great tips based on his dolphin training that fit perfectly for her interns.\nDr. Cox finds the ideal pediatrician for his son: Dr. Norris, who acts and looks just like him. However, Dr. Cox is quick to find a problem with him once Jack develops a cough that scares both him and Jordan.", 
                    "episodename": "My White Whale", 
                    "air_date": "2003-10-23"
                }, 
                "4": {
                    "rating": "7.3", 
                    "description": "Sean is a bit surprised and disturbed to learn about Elliot and J.D.'s history together, but it turns out his anger is really a cover up for his upcoming six month long trip and he doesn't want Elliot to explode.\nDr. Cox. is forced to swallow his pride and actually ask for help when he decides to throw his hat in the ring for the Residency Director position at the hospital.\nCarla picks up an extra shift as a surgical nurse, which allows her to spend the day working alongside with Turk, to his great annoyance.", 
                    "episodename": "My Lucky Night", 
                    "air_date": "2003-10-30"
                }, 
                "5": {
                    "rating": "7.3", 
                    "description": "Dan decides to stay with J.D. for a while after their mom's new fiancé kicks him out, but after spending some quality time with him at the hospital, Dan isn't sure if he likes the cynical person his little brother has become.\nElliot tries to deal with her own problems of a long distance relationship and decides to try moonlighting as a pet examiner with Carla to save up money.", 
                    "episodename": "My Brother, Where Art Thou?", 
                    "air_date": "2003-11-06"
                }, 
                "6": {
                    "rating": "7.3", 
                    "description": "A chance meeting in the elevator sparks a new friendship between J.D. and the mysterious Danni whose ongoing dialogue about her ex forces J.D. to talk about his feelings for Elliot.\nCarla's brother Marco comes to visit, but he still hasn't forgiven Turk for mistaking him for a valet at their mother's funeral. Unfortunately, Turk can't even apologize because Marco can't speak anything but Spanish.\nAt the hospital, Dr. Cox relishes his new job promotion but is surprised when J.D. doesn't follow his lead in contradicting Dr. Kelso's orders.", 
                    "episodename": "My Advice to You", 
                    "air_date": "2003-11-13"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "As J.D.'s relationship with Danni progresses, he and Dr. Cox are forced to spend more time together outside of the hospital, to Perry's great chagrin.\nMeanwhile, as they each deal with problems in their own relationships, Carla and Elliot work to find their own balance between their personal and professional relationships.\nDr. Kelso accidentally punctures his eardrums giving the hospital staff an opportunity to tell him how they truly feel about him.", 
                    "episodename": "My Fifteen Seconds", 
                    "air_date": "2003-11-20"
                }, 
                "8": {
                    "rating": "7.3", 
                    "description": "Turk is happy that he finally makes it through a solo surgery without the assistance of an attending surgeon.\nDr. Cox dreads the fact that he is getting older.\nJ.D. also makes a discovery as he finds out that many of the hospital staff don't know the Janitor as he does.", 
                    "episodename": "My Friend the Doctor", 
                    "air_date": "2003-12-04"
                }, 
                "9": {
                    "rating": "7.4", 
                    "description": "Elliot is feeling uncomfortable using clinical terms for her patient's private parts – a result of a repressed childhood and an accidental orgasm she inflicted on a patient during a pelvic exam - so Carla tries to teach her how to say \"vagina\" and \"penis\" without blushing.\nMeanwhile, Dr. Cox crashes at J.D. and Turk's after taking bad advice from J.D. Carla suggests no more sex until the wedding and Turk only comes to terms with it after learning the real meaning of romance from a patient with prostate cancer. Ultimately Carla backs down on her own idea when she has a stressful day at work finally letting people make fun of her.", 
                    "episodename": "My Dirty Secret", 
                    "air_date": "2003-12-11"
                }, 
                "10": {
                    "rating": "7.5", 
                    "description": "Carla and Elliot try to help a patient, Maggie, lose her virginity as she prepares to die.\nWalking in on her sister and Dr. Cox prompts Danni to move in with J.D. Dr. Cox attempts to convince Turk to do a kidney transplant for a patient he has \"moved up\" the list. But a personal grudge seems to stand in the way and may decide whether the patient lives or dies.", 
                    "episodename": "My Rule of Thumb", 
                    "air_date": "2004-01-22"
                }, 
                "11": {
                    "rating": "7.3", 
                    "description": "J.D. tries to break-up with Danni, but she beats him to it when she realizes that she will always be second place to Elliot in his heart.\nDr. Cox suddenly becomes a nice guy and Elliot changes back to her old self after Dr. Kelso criticizes her new look.", 
                    "episodename": "My Clean Break", 
                    "air_date": "2004-02-03"
                }, 
                "12": {
                    "rating": "7.7", 
                    "description": "J.D. believes he may have finally found a mentor in Dr. Kevin Casey, a surgeon with obsessive-compulsive disorder, and it turns out that Dr. Cox has always been jealous of the guy.\nMeanwhile, the Janitor and his new assistant help Kelso out with a garbage problem.", 
                    "episodename": "My Catalyst", 
                    "air_date": "2004-02-10"
                }, 
                "13": {
                    "rating": "7.6", 
                    "description": "Elliot finds herself perplexed over a simple procedure that leaves her questioning her career path. She goes to seek Dr. Kevin Casey's advice but becomes frustrated when she learns that the epiphany toilet, which the Janitor secretly installed on the roof, is getting more attention than she is.\nMeanwhile, Turk asks J.D. to be his best man at his wedding, which sends J.D. into sheer bliss momentarily until he hears a phone message that makes him question his friendship with Turk.", 
                    "episodename": "My Porcelain God", 
                    "air_date": "2004-02-17"
                }, 
                "14": {
                    "rating": "8.0", 
                    "description": "Jordan's brother and sister return, but Dr. Cox learns that his brother-in-law Ben hasn't visited a doctor about his cancer in the two years he has been gone traveling the world.", 
                    "episodename": "My Screw Up", 
                    "air_date": "2004-02-24"
                }, 
                "15": {
                    "rating": "7.6", 
                    "description": "Jordan's friends Allison and Maddie come to town to provide moral support for Jordan after her brother's death – however, their constant presence does not provide any relief to Dr. Cox.\nMeanwhile, Turk tries to impress the new female surgeon, Dr. Miller, but his first encounter serves only to leave him baffled by the opposite sex yet again. Attempting to reinforce the policy on sexual harassment at Sacred Heart, Carla is forced to teach a course where Dr. Kelso is the number-one student.", 
                    "episodename": "My Tormented Mentor", 
                    "air_date": "2004-03-02"
                }, 
                "16": {
                    "rating": "7.4", 
                    "description": "An ever present butterfly prompts the question on what could have happened different as Turk looks for his lucky do-rag for surgery, and Elliot tries to find a lost stuffed animal for a child needing a bone marrow transplant.", 
                    "episodename": "My Butterfly", 
                    "air_date": "2004-03-16"
                }, 
                "17": {
                    "rating": "7.6", 
                    "description": "J.D. must keep a secret when Carla's \"what-if\" guy asks her out on a date.\nMeanwhile, on the other side of the argument, Carla hounds Turk for checking out other women.\nElliot is also on the spot as Dr. Cox and Dr. Kelso both advise her not to give her patient drugs as they suspect he is an addict faking pain.", 
                    "episodename": "My Moment of Un-Truth", 
                    "air_date": "2004-03-30"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "Turk has to confront a young patient of his, when he accidentally cuts a nerve and the boy (who happens to be a concert pianist) loses use of one of his hands.\nMeanwhile, one of Elliot's patients unintentionally teaches her a lesson about her relationship with J.D.", 
                    "episodename": "His Story II", 
                    "air_date": "2004-04-06"
                }, 
                "19": {
                    "rating": "7.4", 
                    "description": "J.D. hooks up with Danni again, after Sean returns, but he can't forget about his passionate night with Elliot.\nMeanwhile, Dr. Cox realizes, that he might actually have a crush on the one doctor he loathes.", 
                    "episodename": "My Choosiest Choice of All", 
                    "air_date": "2004-04-20"
                }, 
                "20": {
                    "rating": "7.3", 
                    "description": "Elliot asks Sean to move in with her, which only adds to J.D.'s problems.\nTurk is unsure why Dr. Miller's attitude towards him has changed, until he finds out that Carla un-invited her from their wedding.\nDr. Kelso outrages Dr. Cox when he announces that Sacred Heart will begin doing full body scans, starting with an ever present hypochondriac patient, who wants any freebies he can get.", 
                    "episodename": "My Fault", 
                    "air_date": "2004-04-22"
                }, 
                "21": {
                    "rating": "7.6", 
                    "description": "J.D. is unsure what to do, when he realizes he made a mistake telling Elliot he loved her.\nThe Janitor squares off against Dr. Cox after he loses the election of the janitors to Randall.\nCarla's brother Marc constantly puts Turk in a tough situation, when Turk forgets to write his wedding vows.", 
                    "episodename": "My Self-Examination", 
                    "air_date": "2004-04-27"
                }, 
                "22": {
                    "rating": "7.6", 
                    "description": "The big day for Turk and Carla has finally arrived, but a patient holds up Turk.\nWith Elliot still angry at him, J.D. attempts to reconcile her with Sean as a way to make everything right again in their friendship.", 
                    "episodename": "My Best Friend's Wedding", 
                    "air_date": "2004-05-04"
                }, 
                "season_link_sj": ""
            }, 
            "4": {
                "1": {
                    "rating": "7.5", 
                    "description": "The new Dr. Clock arrives with her spaced out personality and doesn't cease to call J.D. \"Johnny.\" But J.D. is fine with it, because there is nothing that is going to bring down his last week of being a resident before he officially becomes a full fledged doctor.", 
                    "episodename": "My Old Friend's New Friend", 
                    "air_date": "2004-08-31"
                }, 
                "2": {
                    "rating": "7.4", 
                    "description": "Dr. Clock tries to reconcile J.D. and Eliot, while waiting to see which one Dr. Cox will give the Chief Resident position to. Molly and Carla are experiencing some subtle conflict and Elliot and J.D. begin to come together after long bouts of conflict of their own.\nMeanwhile, Dr. Cox, Turk and the Janitor are forced to work together to help a patient.", 
                    "episodename": "My Office", 
                    "air_date": "2004-09-07"
                }, 
                "3": {
                    "rating": "7.5", 
                    "description": "Dr. Cox is having issues with Jordan, since Ted revealed that they are still technically married due to some filing problems.\nJ.D. has problems of his own as he can't shake off the tag of Co-Chief Resident the Janitor assigned to him, while Elliot keeps the Chief Resident tag.\nElsewhere, Turk begins to doubt his abilities after letting a patient die and isn't helped, when he finds out J.D. has no confidence in him either.\nDr. Cox and Molly spar about her involvement in his patients.", 
                    "episodename": "My New Game", 
                    "air_date": "2004-09-14"
                }, 
                "4": {
                    "rating": "7.7", 
                    "description": "J.D. is shocked to hear Dr. Cox tell his interns that eventually, they will screw up and kill a patient. J.D. fears his first time killing someone will soon be upon him.\nElliot is upset with Molly, after she disagrees about a patient's promise to attend drug rehab.\nCarla loses Rowdy and she and the Janitor go looking for him.", 
                    "episodename": "My First Kill", 
                    "air_date": "2004-09-21"
                }, 
                "5": {
                    "rating": "7.4", 
                    "description": "Elliot becomes unsure, if she wants Molly as her mentor, when she finds out that Molly doesn't have a perfect home life.\nJ.D. is tested in leadership skills when Dr. Cox yells at him in front of his interns.\nCarla and Turk try to come to an agreement when Turk continuously wakes Carla up every night.", 
                    "episodename": "Her Story", 
                    "air_date": "2004-09-28"
                }, 
                "6": {
                    "rating": "7.8", 
                    "description": "When Dan resurfaces, J.D. is shocked to learn his father has passed away. The reactions from his co-workers help J.D. a little, but the one person, Dr. Cox, who he wanted to be there for him is too busy with J.D.'s patients.\nMeanwhile, Dan sits drunk in the bath tub the whole day and Turk finds out he has Type II Diabetes.", 
                    "episodename": "My Cake", 
                    "air_date": "2004-10-12"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "When J.D. finds Dan with Elliot, Turk tells him to use the hurt brother excuse to get them to break up, just like Turk uses his diabetes to get stuff from Carla. But then J.D. realizes he wasn't hurt at all...\nDr. Cox and Dr. Kelso unite to try and torment their common enemy: Dr. Clock.", 
                    "episodename": "My Common Enemy", 
                    "air_date": "2004-10-19"
                }, 
                "8": {
                    "rating": "7.5", 
                    "description": "When Molly takes a job at a different city, she and J.D. end up having a night of kissing, and he tries to rush to sleep with her before she leaves.\nDr. Cox goes on ambulance duty with a maniac, who he eventually finds out is a woman who has lost her son to an accident.", 
                    "episodename": "My Last Chance", 
                    "air_date": "2004-10-26"
                }, 
                "9": {
                    "rating": "7.6", 
                    "description": "J.D. is approached by a malpractice attorney, asking him to do a risky procedure on her father.\nMeanwhile, Elliot guides Doug to a new career path and Turk struggles to avoid a hypochondriac patient.", 
                    "episodename": "My Malpractical Decision", 
                    "air_date": "2004-11-09"
                }, 
                "10": {
                    "rating": "7.5", 
                    "description": "With the case against Turk on his mind, J.D. attempts to end it with Neena, but she won't take \"no\" for an answer and keeps him wrapped around her finger. Carla tries her own way of persuading Mr. Corman to drop the lawsuit.\nElliot sets out to prove she isn't the doctor she was four years ago and doesn't need to rely on anyone anymore.", 
                    "episodename": "My Female Trouble", 
                    "air_date": "2004-11-16"
                }, 
                "11": {
                    "rating": "7.4", 
                    "description": "J.D. takes matters into his own hands, when searching for a relative for his favorite patient.\nMeanwhile, Elliot is fed up with coworkers not taking her serious and discovers, that she can get her way by flaunting her femininity with some help from Carla and Jordan.", 
                    "episodename": "My Unicorn", 
                    "air_date": "2004-11-23"
                }, 
                "12": {
                    "rating": "7.7", 
                    "description": "When J.D. has to address a bunch of pre-med students about what it's like to be a doctor, he strays off the beaten path and chooses to discuss his best moments as a doctor instead. When he challenges the rest of the staff to do so, they all remember their best memories in the medical field.\nMeanwhile, Elliot is forced to face her fear of children, when she must befriend a ten year old boy, whose father is being treated in the I.C.U.", 
                    "episodename": "My Best Moment", 
                    "air_date": "2004-12-07"
                }, 
                "13": {
                    "rating": "7.5", 
                    "description": "Elliot starts showing J.D. up as the calmer, more competent doctor. A date with the Janitor leads to an a capella sing-off between his \"group\" and Ted's band.\nTurk starts taking his diabetes more serious, when he realizes the dire consequences of the disease.", 
                    "episodename": "My Ocardial Infarction", 
                    "air_date": "2005-01-18"
                }, 
                "14": {
                    "rating": "7.5", 
                    "description": "A man injured in a bar fight teaches Turk and J.D. a lesson about living life to the fullest.", 
                    "episodename": "My Lucky Charm", 
                    "air_date": "2005-01-25"
                }, 
                "15": {
                    "rating": "7.5", 
                    "description": "J.D. has a crush on a girl, who he met at a club, and he's torn about telling her, that her boyfriend has gonorrhea.\nElliot decides to take a stand against Dr. Kelso with one of her patients. And Dr. Cox is blackmailed by the Janitor for a basketball game's score, after he spoils the end of \"The Sixth Sense.\"", 
                    "episodename": "My Hypocritical Oath", 
                    "air_date": "2005-02-01"
                }, 
                "16": {
                    "rating": "7.5", 
                    "description": "J.D. tries to impress Kylie by paying a hobo in the hospital to fake a heart attack, when everything becomes boring due to a quarantine that he caused.\nTurk learns, that Carla dated Cox and gets mad at her for not telling him.\nThe Janitor makes a bet with Dr. Kelso, who is starving, that will make him pay $700, unless the Janitor is able to get a \"face cake,\" in order to satisfy him, from Laverne.\nAlso, Danni Sullivan returns to annoy everyone, causing a constant fight between Ted and Doug.", 
                    "episodename": "My Quarantine", 
                    "air_date": "2005-02-08"
                }, 
                "17": {
                    "rating": "7.6", 
                    "description": "When J.D. meets a former writer from his all time favorite TV show \"Cheers,\" he begins to picture his life at the hospital as a bland, multiple camera sitcom, where everything is perfect and wraps up nicely.\nBack in reality, Cox is relunctant to fire an amiable cafeteria worker, while Turk and Carla struggle to keep their promise of constant romantic affection afloat.", 
                    "episodename": "My Life in Four Cameras", 
                    "air_date": "2005-02-15"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "J.D. is thrown out of the apartment.\nTurk and Carla continue to struggle to keep the romance alive.\nDr. Cox has reason to believe that the son of an old buddy is autistic.", 
                    "episodename": "My Roommates", 
                    "air_date": "2005-02-22"
                }, 
                "19": {
                    "rating": "7.6", 
                    "description": "J.D. ditches a seemingly uninterested Kylie for Dr. Molly Clock, who just returned from Milwaukee.\nCarla fumes over Turk's frequent phone calls to an ex-girlfriend.\nThe Janitor and Dr. Cox make a wager over Elliot.", 
                    "episodename": "My Best Laid Plans", 
                    "air_date": "2005-03-01"
                }, 
                "20": {
                    "rating": "7.7", 
                    "description": "Dr. Kelso dons scrubs to prove a point to Dr. Cox, only to watch it backfire, when an obnoxious patient refuses to listen to him.\nJ.D. and Turk party, while Carla struggles to find solace in Elliot.", 
                    "episodename": "My Boss' Free Haircut", 
                    "air_date": "2005-03-29"
                }, 
                "21": {
                    "rating": "7.5", 
                    "description": "When Carla and J.D. go out to let Carla have some fun, they get drunk and end up accidentally kissing.\nDr. Cox gets the hammer dropped by Jordan, when Jack has to get stitches under Perry's watch.\nElliot has trouble with a male patient, who has taken enhancement pills.", 
                    "episodename": "My Lips Are Sealed", 
                    "air_date": "2005-04-05"
                }, 
                "22": {
                    "rating": "7.6", 
                    "description": "J.D. and Carla get the silent treatment from Turk, who can't seem to control his emotions, after learning about their kiss.\nDr. Cox reluctantly seeks the help of Elliot, when an epileptic patient won't listen to him.\nThe Janitor feels emasculated by his new uniform.\nJordan trys Botox.", 
                    "episodename": "My Big Move", 
                    "air_date": "2005-04-12"
                }, 
                "23": {
                    "rating": "7.4", 
                    "description": "Turk won't open up at couples therapy.\nElliot refuses Dr. Cox's romantic advice, when a very attractive man saunters into the hospital.\nJ.D. learns a lesson in humanity from a dying old woman.\nThe Janitor accidently lets a bunch of rats run around Sacred Heart.", 
                    "episodename": "My Faith in Humanity", 
                    "air_date": "2005-04-19"
                }, 
                "24": {
                    "rating": "7.4", 
                    "description": "Elliot is torn between moving too quickly and ruining her new relationship with Jake.\nDr. Cox teaches Turk about having a healthy ego and Dr. Kelso and the Janitor fight over who gets to use the motorized cart.", 
                    "episodename": "My Drive-By", 
                    "air_date": "2005-04-26"
                }, 
                "25": {
                    "rating": "7.3", 
                    "description": "With their residencies over, there are big changes at Sacred Heart. J.D. moves out to live on his own, while Turk and Carla consider a family change, creating another rift in their long friendship.\nJordan is hired to handle some paperwork for Kelso, which annoys Cox.\nElliot has a job interview at a different hospital thanks to her boyfriend Jake.", 
                    "episodename": "My Changing Ways", 
                    "air_date": "2005-05-10"
                }, 
                "season_link_sj": ""
            }, 
            "5": {
                "1": {
                    "rating": "7.5", 
                    "description": "Attending at Sacred Heart, J.D. now has to deal with his own interns. Turk has doubts having children, then tries to prevent Carla from getting pregnant. Meanwhile Elliot struggles to find her way at County Hospital and doesn't want to seem like the helpless person she was before.", 
                    "episodename": "My Intern's Eyes", 
                    "air_date": "2006-01-03"
                }, 
                "2": {
                    "rating": "7.5", 
                    "description": "J.D. wants to show Dr. Cox and Dr. Kelso how to treat interns, but instead he finds out that they laugh at his bad jokes out of fear and respect.\nEveryone at the hospital is avoiding Jordan to get rid of her except for Turk. An aborted attempt to bond with her results in Jordan being conned by Sam, the drug addict. Elsewhere, Elliot's fellowship goes sour and she finds herself confiding in loose-lipped Carla.", 
                    "episodename": "My Rite of Passage", 
                    "air_date": "2006-01-03"
                }, 
                "3": {
                    "rating": "7.7", 
                    "description": "While planning his birthday, J.D. finds a list of things he wanted to accomplish, before he turned 30. He enters a triathlon to begin. Meanwhile, Elliot discovers a side of her boyfriend Jake, that freaks her out. And Turk is working hard to impress his bosses and takes on a patient, who wants to be hypnotized during surgery in effort to be promoted.", 
                    "episodename": "My Day At The Races", 
                    "air_date": "2006-01-10"
                }, 
                "4": {
                    "rating": "7.7", 
                    "description": "J.D. is asked to introduce Dr. Kelso at an awards dinner, so he wants to find out something good about him. Dr. Kelso and Dr. Cox each have a patient, whom they feel deserves the benefit of a new experimental treatment, but there is only one open slot. Elsewhere, Carla and Turk try to help Elliot get her old job at Sacred Heart back. And the Janitor taunts J.D. with the made up game of \"Jiggly Ball.\"", 
                    "episodename": "My Jiggly Ball", 
                    "air_date": "2006-01-10"
                }, 
                "5": {
                    "rating": "7.4", 
                    "description": "Dr. Cox's religious sister Paige comes to visit for her nephew's baptism. Turk is finding out, just how unsexy baby making can be. Elliot helps him realize that Carla finds the whole process to be romantic. Elswhere, J.D. and the Janitor start a buddy friendship.", 
                    "episodename": "My New God", 
                    "air_date": "2006-01-17"
                }, 
                "6": {
                    "rating": "7.7", 
                    "description": "J.D. mistakes an elderly woman's happiness as her wish to stop treatment for a fatal illness.\nTurk and Elliot struggle to find the cause of a patient's body pain and Carla tries to organize the annual group photo.", 
                    "episodename": "My Missed Perception", 
                    "air_date": "2006-01-17"
                }, 
                "7": {
                    "rating": "7.9", 
                    "description": "In a \"Wizard of Oz\" homage, J.D. is trying to go home, Turk searches for a heart donor and Carla worries, that she doesn't have the courage to become a parent. Meanwhile, Elliot doesn't believe, that she has the brains to lead a question and answer session. Also, the Janitor is painting color coded lines throughout the hospital for easier navigation.", 
                    "episodename": "My Way Home", 
                    "air_date": "2006-01-24"
                }, 
                "8": {
                    "rating": "7.5", 
                    "description": "J.D., Turk, Elliot and Carla are interrogated about the mysterious death of a patient.\nDr. Kelso learns, that J.D. and Turk were away tracking down a patient, Elliot was traumatized over finding out that her make-out buddy was married and Carla was busy recruiting hospital personnel for a group lottery purchase.", 
                    "episodename": "My Big Bird", 
                    "air_date": "2006-01-24"
                }, 
                "9": {
                    "rating": "7.8", 
                    "description": "J.D. meets the klutzy Julie, and when he becomes smitten, Elliot attempts to help out with romance advice. Meanwhile, Carla tries to find Dr. Cox's soft side, when he refuses to kiss his son.\nTurk and the Janitor put together an air band to win a contest, but Kelso gives them a tremendous obstacle.", 
                    "episodename": "My Half-Acre", 
                    "air_date": "2006-02-07"
                }, 
                "10": {
                    "rating": "7.2", 
                    "description": "J.D. is annoyed, that Julie doesn't laugh, so Elliot encourages him, to tell her his feelings, and Turk tries to use psychology to fix the issue.\nMeanwhile, Carla is upset, when the Janitor refers to a new nurse as a \"hot young Carla,\" which intensifies her growing concern, that she is too old to conceive.", 
                    "episodename": "Her Story II", 
                    "air_date": "2006-02-07"
                }, 
                "11": {
                    "rating": "7.3", 
                    "description": "J.D. is still dealing with his recent breakup and trying not to kill intern Keith, who has become annoyingly perfect. To make matters worse, a favorite patient is in a serious coma and each of the staff finds their own way to deal with it.\nDr. Cox and the Janitor bond over drinks at the bar and Carla makes it her mission to make the hospital's gym female friendly. Meanwhile Turk suggests, that J.D. and Elliot find themselves 'booty calls'.", 
                    "episodename": "My Buddy's Booty", 
                    "air_date": "2006-02-28"
                }, 
                "12": {
                    "rating": "7.8", 
                    "description": "Dr. Kelso is outraged, when he discovers, that a bird has been living in Sacred Heart. He orders the Janitor to dispose of it immediately. However, the Janitor likes the bird so much, he secretly keeps it as a pet. Meanwhile, J.D., annoyed with Keith, tries to get his intern fired, but things don't turn out as intended.", 
                    "episodename": "My Cabbage", 
                    "air_date": "2006-02-28"
                }, 
                "13": {
                    "rating": "7.6", 
                    "description": "J.D. and Dr. Cox go through the five stages of grief with their favorite patient, who is declining in health. Carla forces Turk to go on a string of double dates, including Elliot and her booty call Keith. Elsewhere, Dr. Kelso hits Ted with his car, thus Ted finally has the upper hand with a potential lawsuit.", 
                    "episodename": "My Five Stages", 
                    "air_date": "2006-03-07"
                }, 
                "14": {
                    "rating": "7.4", 
                    "description": "J.D. is sick of perfect intern Keith and he's not the only one. Elliot's relationship with Keith is revealed, so the other interns think that he is getting special attention. In the meantime Dr. Cox boasts about being named \"The Best Doctor in the City\" by a local magazine, thus Dr. Kelso assigns him to the most difficult patient in the hospital to deflate his ego. Also, Turk and Carla continue to struggle in their quest for conception.", 
                    "episodename": "My Own Personal Hell", 
                    "air_date": "2006-03-14"
                }, 
                "15": {
                    "rating": "7.4", 
                    "description": "J.D. urges Cox and his fellow doctors to do special, unconventional things for their patients, but J.D. himself is not sure he can shave his head for a woman undergoing chemotherapy, after meeting a woman who loves his hair. Meanwhile,Turk and Carla attempt to eliminate all the stress in their lives, to better their chances of conceiving. Also, Elliot can't stop giving her new boyfriend Keith stupid gifts.", 
                    "episodename": "My Extra Mile", 
                    "air_date": "2006-03-21"
                }, 
                "16": {
                    "rating": "7.5", 
                    "description": "Turk finds out, that Carla is pregnant, before she does, so J.D. convinces Turk to tell the entire hospital staff to surprise Carla with the news. But Carla wants to personally share her baby news with everybody, so Turk and J.D. have to quickly contain the hospital gossip. Meanwhile, when Elliot puts Dr. Cox into an embarrassing situation, he decides to get even with Elliot through Keith and Carla.", 
                    "episodename": "My Bright Idea", 
                    "air_date": "2006-03-28"
                }, 
                "17": {
                    "rating": "7.5", 
                    "description": "When J.D. rearranges his schedule to allow himself more time to spend with Turk, Turk secretly resents hanging out with J.D. in that time because it interferes with his own \"Turk Time.\"\nMeanwhile, Dr. Cox and Jordan go on a double date with Elliot and Keith, and Carla covers for Kelso at work, as he grieves for his dead dog.\nLater, a patient almost dies, after giving up part of his liver for his brother, and the hospital staff learns about making sacrifices for the people they really care about.", 
                    "episodename": "My Chopped Liver", 
                    "air_date": "2006-04-04"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "J.D.'s brother Dan returns for a surprise visit and Elliot learns that J.D. has been telling Dan that she still likes him. A patient with weight-related problems needs an MRI, but he's too big for the machine. Carla and Turk freak out when they begin to discuss baby names. Meanwhile, Dr. Kelso assigns Dr. Cox to assist Ted with malpractice claim paperwork after Dr. Cox insults Dr. Kelso's son.", 
                    "episodename": "My New Suit", 
                    "air_date": "2006-04-11"
                }, 
                "19": {
                    "rating": "7.5", 
                    "description": "Turk and Carla turn J.D.'s old bedroom into a nursery for the baby. The Janitor seizes an opportunity to shove J.D. out of the picture for a day. Elsewhere, Elliot uses her mother to learn information about Keith's peers and Turk & Dr. Cox accuse each other of not being hip.", 
                    "episodename": "His Story III", 
                    "air_date": "2006-04-18"
                }, 
                "20": {
                    "rating": "8.1", 
                    "description": "J.D. asks Dr. Cox out for lunch, but runs into annoying former patient Jill Tracy, who unexpectedly teaches him something about responsibility.\nElliot and Carla discover that Todd has been lying about all his hospital \"conquests\" and suspect that he's been less than truthful about other issues. Turk warns them not to meddle in his affairs.", 
                    "episodename": "My Lunch", 
                    "air_date": "2006-04-25"
                }, 
                "21": {
                    "rating": "7.9", 
                    "description": "Dr. Cox starts drinking after his decisions result in the death of three of his patients. The staff tries to cover for him at the hospital, while everyone tries to convince him how inspiring he is for them.\nTurk starts his new rotation with orthopedic surgery, but isn't so fond of his attending doctor's touchy-feely methods. Thus, J.D. and the Janitor attempt to help Turk find ways to bond with his new supervisor.", 
                    "episodename": "My Fallen Idol", 
                    "air_date": "2006-05-02"
                }, 
                "22": {
                    "rating": "7.4", 
                    "description": "J.D. feels that the same things happen over and over again at the hospital. Dr. Cox returns to work, but Elliot believes that he has lost his usual confidence. Elliot calls Dr. Cox on his behavior. Carla gets fed up with Turk, because he still can do a lot of stuff, but she can't since she is now pregnant.", 
                    "episodename": "My Déjà Vu, My Déjà Vu", 
                    "air_date": "2006-05-09"
                }, 
                "23": {
                    "rating": "7.5", 
                    "description": "J.D. challenges an urologist's assessment on a consult for a patient in need of a risky surgical procedure. He also starts to fall for her. Meanwhile, Elliot considers breaking up with Keith, but Carla is showing extreme hormonal changes due to her pregnancy and tries to interfere. The Janitor and Dr. Kelso are having a little tiff of their own about fear.", 
                    "episodename": "My Urologist", 
                    "air_date": "2006-05-16"
                }, 
                "24": {
                    "rating": "7.7", 
                    "description": "J.D. plans a date with Kim on their night off but Elliot keeps getting in their way. Meanwhile, Elliot throws a baby shower for Carla.Perry and Jordan hand over all of Jack's stuff to Carla. And someone announces a very surprising pregnancy.", 
                    "episodename": "My Transition", 
                    "air_date": "2006-05-16"
                }, 
                "season_link_sj": ""
            }, 
            "6": {
                "1": {
                    "rating": "7.7", 
                    "description": "J.D. addresses the news that he is going to be a father and Dr. Cox is worried about how his anger is going to impact his offspring. Meanwhile, Carla and Turk prepare for the impending arrival of their new baby. Elliot feels left out because she is childless, while the Janitor wonders if he has wasted his life.", 
                    "episodename": "My Mirror Image", 
                    "air_date": "2006-11-30"
                }, 
                "2": {
                    "rating": "7.7", 
                    "description": "J.D. and Kim start contemplating about their future and their baby's future. Meanwhile, Turk rushes Carla to the hospital after she goes into labor. And Jordan accuses Dr. Cox of not being a more defensive father towards Jack.", 
                    "episodename": "My Best Friend's Baby's Baby and My Baby's Baby", 
                    "air_date": "2006-12-07"
                }, 
                "3": {
                    "rating": "7.5", 
                    "description": "J.D. and Kim are surprised of how much they have in common. Recently giving birth, Carla doesn't want to return to work. Meanwhile, Elliot tries to persuade Dr. Turner, a surgeon with thirty years of experience, that medicine is the better option to work with and that surgery could kill him.", 
                    "episodename": "My Coffee", 
                    "air_date": "2006-12-14"
                }, 
                "4": {
                    "rating": "7.4", 
                    "description": "Dr. Cox feels like the TV character House when he has to solve several mysteries, one of them being Elliot's anger towards Dr. Kelso, while for some reason she is taking it out on Turk.\nJ.D. tries to be a better boyfriend to Kim.", 
                    "episodename": "My House", 
                    "air_date": "2007-01-04"
                }, 
                "5": {
                    "rating": "7.5", 
                    "description": "Elliot begins enjoying luxuries since she has extra money with her new private practice gig. But eventually, J.D. becomes jealous of her and that forbids him the use of these privileges.\nDr. Cox and the Janitor become roommates in one of the hospital suites, while Turk tries to convince Carla that she has postpartum depression and that she needs help.", 
                    "episodename": "My Friend With Money", 
                    "air_date": "2007-01-11"
                }, 
                "6": {
                    "rating": "7.9", 
                    "description": "A new patient at the hospital wakes up and sees everything happening around her as a musical.\nCarla can't decide whether or not to return to work and Elliot must find a way to tell J.D. he can't move into her new house with her.", 
                    "episodename": "My Musical", 
                    "air_date": "2007-01-18"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "The hospital is seen through the eyes of Dr. Kelso, who befriends an Iraq War veteran.\nThe soldier's stay sparks a political debate among staff members.", 
                    "episodename": "His Story IV", 
                    "air_date": "2007-02-01"
                }, 
                "8": {
                    "rating": "7.4", 
                    "description": "After being convinced to go to Tacoma for Kim's first ultrasound, J.D., along with Carla, Elliot, Janitor, Keith and Ted, takes Kelso's new RV on a road trip. Meanwhile, Jordan and Dr. Cox have trouble when Jordan's ultrasound reveals that the baby will need surgery.", 
                    "episodename": "My Road To Nowhere", 
                    "air_date": "2007-02-08"
                }, 
                "9": {
                    "rating": "7.5", 
                    "description": "A Croatian Doctor comes to Sacred Heart, only to find out that he has to redo his Internship there.\nJ.D. shows symptoms of 'Vasovagal Syncope', a condition that causes fainting and blackouts.\nTurk and Elliot argue over whose turn it is to take care of him, whilst Carla tries out her new excuse \"I have a baby\" and the Janitor takes a vacation.", 
                    "episodename": "My Perspective", 
                    "air_date": "2007-02-15"
                }, 
                "10": {
                    "rating": "7.7", 
                    "description": "J.D. develops a crush on a new physical therapist but due to his latest misfortunes, he finds it difficult to ask her out. Elliot asks Keith to move in with her, but is not willing to budge on her home rules. Turk breaks his arm and is sent back to residency by Dr. Kelso. Thanks to Dr. Cox, he realizes that he doesn't know as much about medicine as he thought.", 
                    "episodename": "My Therapeutic Month", 
                    "air_date": "2007-02-22"
                }, 
                "11": {
                    "rating": "7.2", 
                    "description": "A memory loss patient is the peg for a look back on the last seasons of Scrubs, when the Sacred Heart crew looks back at their memorable moments.", 
                    "episodename": "My Night To Remember", 
                    "air_date": "2007-03-01"
                }, 
                "12": {
                    "rating": "7.3", 
                    "description": "When Private Dancer is released from the hospital, the military informs him that his injuries are too severe to be reinstated into the service, so he gets depressed. The Sacred Heart staff try to cheer him up, while the Janitor is having a fish problem.", 
                    "episodename": "My Fishbowl", 
                    "air_date": "2007-03-08"
                }, 
                "13": {
                    "rating": "7.5", 
                    "description": "J.D. and Turk try to treat Dr. Kelso's uninsured friend. Meanwhile, Dr. Kelso himself is concerned about a clothing thief. Elsewhere, Dr. Cox tries to convince Elliot that a reformed drug addict isn't exactly clean, and the Janitor blackmails Carla.", 
                    "episodename": "My Scrubs", 
                    "air_date": "2007-03-15"
                }, 
                "14": {
                    "rating": "7.7", 
                    "description": "Laverne and Dr. Cox engage in a philosophical debate. Carla finds a hot nanny for Isabella, and Turk struggles to find a way not to leer at her.\nElliot smuggles a patient's dog into the hospital to cheer her up and ends up in hot water with Dr. Kelso. A tragic twist awaits at the end, challenging everyone to decide if they think everything happens for a reason.", 
                    "episodename": "My No Good Reason", 
                    "air_date": "2007-03-22"
                }, 
                "15": {
                    "rating": "7.7", 
                    "description": "Laverne is brain-dead, and her family decides to take her off life support. One by one, the staff say their goodbyes, except Carla, who stoutly refuses to accept what's happening. She consequently finds herself \"haunted\" by Laverne. Meanwhile, Jordan gives birth, but Dr. Cox doesn't want to tell anyone because he doesn't want his daughter's birthday to always be associated with Laverne's death.", 
                    "episodename": "My Long Goodbye", 
                    "air_date": "2007-04-05"
                }, 
                "16": {
                    "rating": "7.4", 
                    "description": "In the wake of Laverne's funeral, the Sacred Heart Staff decide to implement lessons from her life to their actions. Carla is upset that everyone seems to act as if nothing has changed. Dr. Cox tries to take twenty minutes for himself every day, but has great difficulty doing that. Meanwhile, the Janitor helps J.D. and Turk treat a deaf patient. And Elliot learns that Keith wants more from their relationship.", 
                    "episodename": "My Words of Wisdom", 
                    "air_date": "2007-04-12"
                }, 
                "17": {
                    "rating": "7.6", 
                    "description": "The perspective shifts between Jordan, Ted, and Todd, as they go about their day.\nJordan messes with Elliot and Keith's relationship and is disturbed when it doesn't give her any satisfaction. Ted tries to settle a pay dispute between the nurses and Dr. Kelso. Todd has found his calling in plastic surgery, but must convince Turk not to interfere with a sixteen-year-old girl getting breast implants.", 
                    "episodename": "Their Story", 
                    "air_date": "2007-04-19"
                }, 
                "18": {
                    "rating": "7.4", 
                    "description": "When Keith leaves town for a few days, J.D. expects that he'll finally be able to spend some quality time with Elliot. But he doesn't anticipate Elliot's old college friend dropping by. J.D. switches between hitting on her and competing with her for Elliot's attention. Meanwhile, Turk and Dr. Cox volley a hypochondriac patient back and forth since there's nothing wrong with him.", 
                    "episodename": "My Turf War", 
                    "air_date": "2007-04-26"
                }, 
                "19": {
                    "rating": "7.5", 
                    "description": "J.D. tries to get together with Elliot's sorority sister Melody, but she just wants to make out with him without going further. Meanwhile, Keith re-proposes to Elliot after she gets to make everything perfect, while everyone has fantasies about being married to Elliot. Elliot and Carla are having problems figuring out what is wrong with two elderly patients, who show the same symptoms but have no obvious connection.", 
                    "episodename": "My Cold Shower", 
                    "air_date": "2007-05-03"
                }, 
                "20": {
                    "rating": "7.5", 
                    "description": "J.D. and Turk go to a medical convention in Phoenix, Arizona, where they run into J.D.'s ex-girlfriend Dr. Kim Briggs, who has a surprise for J.D. Meanwhile at Sacred Heart, the janitor pretends to be the chief of medicine and Dr. Cox starts to put doubts about the wedding into Elliot's mind.", 
                    "episodename": "My Conventional Wisdom", 
                    "air_date": "2007-05-10"
                }, 
                "21": {
                    "rating": "7.4", 
                    "description": "Kim moves in with J.D. in order to raise their child together. J.D. learns from Turk and Dr. Cox that fatherhood changes the way of how to see things.\nCarla complains to Elliot about her being a control freak when they prepare the bachelorette party.", 
                    "episodename": "My Rabbit", 
                    "air_date": "2007-05-17"
                }, 
                "22": {
                    "rating": "7.7", 
                    "description": "In the season finale, J.D. and Elliot start thinking about their future and if they both made a mistake in not being with each other. The Janitor activates the \"Brain Trust\" to come up with the perfect wedding gift for Elliot.", 
                    "episodename": "My Point Of No Return", 
                    "air_date": "2007-05-17"
                }, 
                "season_link_sj": ""
            }, 
            "7": {
                "1": {
                    "rating": "7.6", 
                    "description": "In the aftermath of their near-indiscretion, Elliot realizes she doesn't want to be with Keith, and J.D. resolves to stop sabotaging himself.\nMeanwhile, Dr. Cox and Turk find a patient they both like who is in danger of being discharged.", 
                    "episodename": "My Own Worst Enemy", 
                    "air_date": "2007-10-25"
                }, 
                "2": {
                    "rating": "7.7", 
                    "description": "Kim goes into labor, and J.D. struggles to decide if he should tell her what he really thinks of their relationship. Turk, desperate to do something not baby-related, races to beat a video game before Carla discovers him. And Dr. Cox searches for someone he trusts enough to give his daughter a shot.", 
                    "episodename": "My Hard Labor", 
                    "air_date": "2007-11-01"
                }, 
                "3": {
                    "rating": "7.5", 
                    "description": "J.D's brother Dan returns and delivers a few home truths to his little brother. In the meantime, Elliot and Dr. Cox debate over the morals of their practice and the staff of Sacred Heart find the Janitor's behavior rather odd after he watches \"An Inconvenient Truth\".", 
                    "episodename": "My Inconvenient Truth", 
                    "air_date": "2007-11-08"
                }, 
                "season_link_sj": "", 
                "5": {
                    "rating": "7.4", 
                    "description": "The Sacred Heart staff has to deal with their inner child, when J.D. and Turk remember their first prank, Dr. Cox has a ten year old Leukemia patient and Dr. Kelso celebrates his birthday.", 
                    "episodename": "My Growing Pains", 
                    "air_date": "2007-11-29"
                }, 
                "6": {
                    "rating": "7.6", 
                    "description": "Though Elliot boasts that through private practice she gets to get to know her patients, nobody seems to care. Carla is amazed at how the Janitor was able to score such an attractive girlfriend. The doctors are improving their services to get a higher ranking on a website and although J.D. appears nonchalant initially, he is elated when he is ranked #1.", 
                    "episodename": "My Number One Doctor", 
                    "air_date": "2007-12-06"
                }, 
                "7": {
                    "rating": "7.4", 
                    "description": "J.D.'s teenage burn patient gives him a hard decision to make when he wants to go to his high school graduation. Turk doesn't want Carla to find out that he secretly learned Spanish. And to address Dr. Kelso's weight gain, Dr. Cox makes a game out of stealing his breakfast.", 
                    "episodename": "My Bad Too", 
                    "air_date": "2008-04-10"
                }, 
                "8": {
                    "rating": "7.6", 
                    "description": "When Dr. Kelso tells the Janitor that nobody cares what he thinks, he starts a newspaper called \"The Janitorial\" to prove him wrong. J.D. and Turk fight over their manhood issues, while Dr. Kelso is too proud to ask for help about one of his problems.", 
                    "episodename": "My Manhood", 
                    "air_date": "2008-04-17"
                }, 
                "9": {
                    "rating": "7.8", 
                    "description": "Dr. Cox had a patient that he hadn't been able to diagnose for two years, and he is back again.\nDr. Kelso has to face a retirement board when his true age is revealed. Elliot and Carla try to find enough people in favor of Dr. Kelso to keep him as Chief of Medicine.", 
                    "episodename": "My Dumb Luck", 
                    "air_date": "2008-04-24"
                }, 
                "10": {
                    "rating": "7.6", 
                    "description": "Elliot and J.D. discover a major change in their relationship, when they spend time together looking for a former patient.\nDr. Cox contemplates his new job title, when Ted refuses to do the majority of his work, whilst Carla and Turk talk about the possibility of a second baby. Meanwhile, the Janitor claims Dr. Kelso's abandoned office for the brain trust.", 
                    "episodename": "My Waste of Time", 
                    "air_date": "2008-05-01"
                }, 
                "11": {
                    "rating": "7.6", 
                    "description": "After a hard day of work, Dr. Cox has the burden to tell his son Jack a good night story, so he disguises his hard day as a fairy tale about the little village Sacred Heartlia with Carla and Turk as the two-headed witch Turla, Elliot as the princess and J.D. as the village idiot.\nOther people featuring are the Janitor as the giant, Keith as the prince, Dr. Kelso as the dark lord Oslek, Ted as his hunchback and of course Dr. Cox as the brave knight.", 
                    "episodename": "My Princess", 
                    "air_date": "2008-05-08"
                }, 
                "4": {
                    "rating": "7.5", 
                    "description": "Turk tries to assure a worried Carla that their daughter will acknowledge her Latin heritage. Meanwhile the Janitor challenges J.D. to identify everyone in the hospital, when it is discovered that he uses nicknames, because he doesn't know the people's actual names. If J.D. can't name all of them, he must take up the mop for a day. Elsewhere, Dr. Cox realizes that he is lonely without his wife and children.", 
                    "episodename": "My Identity Crisis", 
                    "air_date": "2007-11-15"
                }
            }, 
            "8": {
                "1": {
                    "rating": "7.2", 
                    "description": "Dr. Kelso's beautiful but unethical replacement, Dr. Maddox, shakes things up at Sacred Heart, while J.D. struggles to manage a new crop of incompetent interns and Carla helps Elliott put her ego in check.", 
                    "episodename": "My Jerks", 
                    "air_date": "2009-01-06"
                }, 
                "2": {
                    "rating": "7.6", 
                    "description": "J.D. and Turk make a huge sacrifice concerning a decade-long steak night tradition for a dying patient. Meanwhile, Dr. Maddox, the new Chief of Medicine, begins to show her true colors.", 
                    "episodename": "My Last Words", 
                    "air_date": "2009-01-06"
                }, 
                "3": {
                    "rating": "7.4", 
                    "description": "Dr. Kelso and Dr. Cox have to work together again to get rid of Dr. Maddox, while Carla faces an incompetent intern.", 
                    "episodename": "My Saving Grace", 
                    "air_date": "2009-01-13"
                }, 
                "season_link_sj": "", 
                "5": {
                    "rating": "7.1", 
                    "description": "Featuring a special appearance from Sesame Workshop's \"Muppets\", J.D. learns a lesson about the gift of compassion, while Elliot gets scammed by intern Katie to secure a spot on Turk's team.", 
                    "episodename": "My ABC's", 
                    "air_date": "2009-01-27"
                }, 
                "6": {
                    "rating": "7.5", 
                    "description": "Elliot and J.D. encounter a road block in their newfound romantic relationship, and Dr. Cox considers taking the now vacant Chief of Medicine post.", 
                    "episodename": "My Cookie Pants", 
                    "air_date": "2009-01-27"
                }, 
                "7": {
                    "rating": "7.3", 
                    "description": "As his increasing workload from being Chief of Medicine begins to take a toll, the unimaginable happens when Dr. Cox reaches out to Dr. Kelso for friendship.", 
                    "episodename": "My New Role", 
                    "air_date": "2009-02-03"
                }, 
                "8": {
                    "rating": "7.6", 
                    "description": "It's Ted's lucky day when he falls head over heels in love with an ukulele player, and Dr. Cox realizes he cannot handle everything that is thrown at him.", 
                    "episodename": "My Lawyer's in Love", 
                    "air_date": "2009-02-03"
                }, 
                "9": {
                    "rating": "7.4", 
                    "description": "J.D. manages to still bother Dr. Cox despite being away on a vacation from the hospital. Meanwhile, Turk and Carla have some big news to announce.", 
                    "episodename": "My Absence", 
                    "air_date": "2009-02-10"
                }, 
                "10": {
                    "rating": "7.4", 
                    "description": "J.D. and Turk gather up a new crop of interns as they organize their annual (and historically unfunny) sketch show.", 
                    "episodename": "My Comedy Show", 
                    "air_date": "2009-02-10"
                }, 
                "11": {
                    "rating": "7.2", 
                    "description": "While Turk views an inspiring story on SportsCenter, he comes up with a new procedure which may help a paralyzed teen. Meanwhile, Dr. Cox and the janitor are suffering from romantic problems", 
                    "episodename": "My Nah Nah Nah", 
                    "air_date": "2009-03-18"
                }, 
                "12": {
                    "rating": "7.2", 
                    "description": "J.D.'s ego becomes inflated after Dr. Cox finally gives him the recognition he's been waiting for. Elsewhere, the senior staff receives insight from the interns.", 
                    "episodename": "Their Story II", 
                    "air_date": "2009-03-25"
                }, 
                "13": {
                    "rating": "7.6", 
                    "description": "A combination of a full moon and some bad luck causes Sacred Heart's new crop of interns to receive their toughest case load yet while Elliot makes an important decision regarding her future as a doctor.", 
                    "episodename": "My Full Moon", 
                    "air_date": "2009-04-01"
                }, 
                "14": {
                    "rating": "7.4", 
                    "description": "The Janitor and Lady invite the Sacred Heart staff to their fake wedding in the Bahamas hoping to score some loot but their scheme is about to backfire...", 
                    "episodename": "My Soul on Fire (1)", 
                    "air_date": "2009-04-08"
                }, 
                "15": {
                    "rating": "7.6", 
                    "description": "The tropical seaside wedding goes ahead as the Janitor and Lady tie the knot which affirms the relationship of another couple.", 
                    "episodename": "My Soul on Fire (2)", 
                    "air_date": "2009-04-15"
                }, 
                "16": {
                    "rating": "7.4", 
                    "description": "Things get weird for J.D. when he discovers the identity of Kim's new man as he plans to reach out to her in order to move closer to Sam. Meanwhile, Turk starts a campaign for a promotion.", 
                    "episodename": "My Cuz", 
                    "air_date": "2009-04-22"
                }, 
                "17": {
                    "rating": "7.3", 
                    "description": "Change doesn't come easy for the gang when J.D. considers moving closer to his son. Meanwhile, Turk gets comfortable as chief of surgery, while Ted and Gooch reach a new level in their relationship.", 
                    "episodename": "My Chief Concern", 
                    "air_date": "2009-05-05"
                }, 
                "18": {
                    "rating": "8.0", 
                    "description": "J.D. is planning on leaving Sacred Heart but before he goes there are a few things that he wants to do including; getting a hug from Dr. Cox, and learning the Janitor's real name. Elliot is ready for the next step in her and J.D.'s relationship and she begins moving her furniture into J.D.'s apartment.", 
                    "episodename": "My Finale", 
                    "air_date": "2009-05-06"
                }, 
                "4": {
                    "rating": "7.3", 
                    "description": "J.D. and Elliot's relationship seems to have been rekindled when they encourage Dr. Kelso to find his true happy place.", 
                    "episodename": "My Happy Place", 
                    "air_date": "2009-01-13"
                }
            }, 
            "9": {
                "1": {
                    "rating": "7.2", 
                    "description": "J.D., Turk, Cox, Kelso and intern Denise return to Sacred Heart to teach med school, while new med students Lucy, Drew, Cole and Maya are put through the wringer on their first day of school.", 
                    "episodename": "Our First Day of School", 
                    "air_date": "2009-12-01"
                }, 
                "2": {
                    "rating": "7.1", 
                    "description": "Lucy learns a hard earned lesson about what it takes to be a doctor. Meanwhile J.D. and Turk spot a potential love connection between Denise and the new med student, Drew, as they play matchmakers with a little bit of help from Dr. Kelso.", 
                    "episodename": "Our Drunk Friend", 
                    "air_date": "2009-12-01"
                }, 
                "3": {
                    "rating": "7.1", 
                    "description": "J.D. and Drew learn a tough lesson in mentoring when Dr. Cox and Lucy show them that sometimes the student is the teacher.", 
                    "episodename": "Our Role Models", 
                    "air_date": "2009-12-08"
                }, 
                "season_link_sj": "", 
                "5": {
                    "rating": "7.2", 
                    "description": "J.D. still clamors for Dr. Turk's approval as he approaches his final day of teaching at Sacred Heart, Lucy searches within herself for the courage to perform a basic medical procedure on a real human, and Denise and Drew make things official.", 
                    "episodename": "Our Mysteries", 
                    "air_date": "2009-12-22"
                }, 
                "6": {
                    "rating": "7.3", 
                    "description": "While Turk struggles to find a replacement best friend, Elliott offers some sound advice and guidance to an over-worked and exhausted Lucy.", 
                    "episodename": "Our New Girl-Bro", 
                    "air_date": "2010-01-01"
                }, 
                "7": {
                    "rating": "6.9", 
                    "description": "Before receiving their white coats, the med students of Winston University must figure out why they want to be doctors, and Denise gets a little relationship help from Elliot.", 
                    "episodename": "Our White Coats", 
                    "air_date": "2010-01-05"
                }, 
                "8": {
                    "rating": "7.3", 
                    "description": "Lucy finds couplings, dysfunctional or not, throughout the hospital", 
                    "episodename": "Our Couples", 
                    "air_date": "2010-01-05"
                }, 
                "9": {
                    "rating": "7.4", 
                    "description": "The reality of having a baby begins to settle in for both J.D. and Elliot while Lucy struggles with the reality of operating on people.", 
                    "episodename": "Our Stuff Gets Real", 
                    "air_date": "2010-01-12"
                }, 
                "10": {
                    "rating": "7.4", 
                    "description": "A case of guilty conscience plagues the med school when a student cheats on an exam and Dr. Cox takes it out on the entire class. Meanwhile, Denise makes a startling admission of her own.", 
                    "episodename": "Our True Lies", 
                    "air_date": "2010-01-19"
                }, 
                "11": {
                    "rating": "7.4", 
                    "description": "Lucy takes her new assignment as hell week \"team leader\" a bit too seriously, and Dr. Turk feels threatened when an internationally renowned surgeon pays a visit.", 
                    "episodename": "Our Dear Leaders", 
                    "air_date": "2010-01-26"
                }, 
                "12": {
                    "rating": "7.2", 
                    "description": "When Cole and Kelso both get negative results back after a few routine tests, they learn the hard way to put their egos in check in order to rein in the support of their so-called friends.", 
                    "episodename": "Our Driving Issue", 
                    "air_date": "2010-03-10"
                }, 
                "13": {
                    "rating": "7.6", 
                    "description": "The med students of Winston University finally find something to be thankful for when Cole identifies his true calling in surgery, Drew finds the love of his life, and Lucy finds the inspiration to become a doctor.", 
                    "episodename": "Our Thanks", 
                    "air_date": "2010-03-17"
                }, 
                "4": {
                    "rating": "7.1", 
                    "description": "While their wives are out of town, J.D. and Turk attend a med student's party; Kelso says goodbye to Ted and Gooch.", 
                    "episodename": "Our Histories", 
                    "air_date": "2009-12-15"
                }
            }
        }, 
        "quality": ""
    }
}